Berichtencatalogus/uitgifteservice/dispatchDataRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <gmn:dispatchDataRequest
            xmlns:gmn="http://www.broservices.nl/xsd/dsgmn/1.0"
            xmlns:brocom="http://www.broservices.nl/xsd/brocommon/3.0"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xsi:schemaLocation="http://www.broservices.nl/xsd/dsgmn/1.0 https://schema.broservices.nl/xsd/isgmn/1.0/dsgmn-messages.xsd">
      <!-- Disclaimer: dit voorbeeldbericht valideert tegen de XSD van de uitgifteservice.
           Het is niet gevalideerd door de uitgifteservice en is vaktechnisch/inhoudelijk niet voorbeeldig.
      -->
      <brocom:requestReference>uitgifte-38</brocom:requestReference>
      <brocom:broId>GMN123456789012</brocom:broId>
      <gmn:dataToBeDelivered>actueelHistorisch</gmn:dataToBeDelivered>
    </gmn:dispatchDataRequest>
  </soap:Body>
</soap:Envelope>
